#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
module.silver-3d5c3f-team.sysdig_monitor_alert_metric.reques_count_alert_three: Refreshing state... [id=10777904]
module.silver-3d5c3f-team.sysdig_monitor_alert_metric.ops_genie_alert: Refreshing state... [id=10777894]
module.silver-3d5c3f-team.sysdig_monitor_alert_metric.sand_patroni_pods_low: Refreshing state... [id=10777890]
module.silver-3d5c3f-team.sysdig_monitor_alert_metric.sand_prod_patroni_cpu_spike: Refreshing state... [id=10777906]
module.silver-3d5c3f-team.sysdig_monitor_alert_metric.sand_prod_cpu_spike: Refreshing state... [id=10777889]
module.silver-3d5c3f-team.sysdig_monitor_alert_metric.pgsql_pod_restart_prod: Refreshing state... [id=10777891]
module.silver-3d5c3f-team.sysdig_monitor_alert_metric.request_time_alert_test_four: Refreshing state... [id=10777897]
module.silver-3d5c3f-team.sysdig_monitor_alert_metric.sand_dev_patroni_pods_med: Refreshing state... [id=10777903]
module.silver-3d5c3f-team.sysdig_monitor_alert_metric.sand_dev_sso_cpu_spike: Refreshing state... [id=10777905]
module.silver-3d5c3f-team.sysdig_monitor_alert_metric.sand_prod_keycloak_pods_high: Refreshing state... [id=10777899]
module.silver-3d5c3f-team.sysdig_monitor_alert_metric.sand_keycloak_pods_low: Refreshing state... [id=10777888]
module.silver-3d5c3f-team.sysdig_monitor_alert_metric.sand_prod_patroni_pods_med: Refreshing state... [id=10777893]
module.silver-3d5c3f-team.sysdig_monitor_alert_metric.request_time_alert_test_three: Refreshing state... [id=10777898]
module.silver-3d5c3f-team.sysdig_monitor_alert_metric.request_time_alert_test: Refreshing state... [id=10777901]
module.silver-3d5c3f-team.sysdig_monitor_alert_metric.request_time_alert_test_two: Refreshing state... [id=10777895]
module.silver-3d5c3f-team.sysdig_monitor_alert_metric.sand_dev_sso_cpu_elevated: Refreshing state... [id=10777892]
module.silver-3d5c3f-team.sysdig_monitor_alert_metric.sand_prod_keycloak_pods_med: Refreshing state... [id=10777896]
module.silver-3d5c3f-team.sysdig_monitor_alert_metric.sand_dev_sso_cpu_spike_two: Refreshing state... [id=10777902]
module.silver-3d5c3f-team.sysdig_monitor_alert_metric.prod_filesystem_over_sixty: Refreshing state... [id=10777900]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_pods_med: Refreshing state... [id=9921897]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_backup_storage_pv_usage_gt_med: Refreshing state... [id=9921933]
module.eb75ad-team.sysdig_monitor_alert_promql.prod_minio_pvc_storage_low: Refreshing state... [id=14080753]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_pods_high: Refreshing state... [id=9921902]
module.eb75ad-team.sysdig_monitor_dashboard.pv_overall: Refreshing state... [id=363087]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_cpu_usage_high: Refreshing state... [id=9921898]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_pods_low: Refreshing state... [id=9921901]
module.eb75ad-team.sysdig_monitor_alert_promql.dev_db_pv_usage_ninety: Refreshing state... [id=14625871]
module.eb75ad-team.sysdig_monitor_dashboard.pv_usage: Refreshing state... [id=363085]
module.eb75ad-team.sysdig_monitor_alert_promql.prod_db_pv_usage_low: Refreshing state... [id=9921935]
module.eb75ad-team.sysdig_monitor_alert_promql.prod_backup_storage_pv_usage_gt_low: Refreshing state... [id=9921936]
module.eb75ad-team.sysdig_monitor_alert_promql.prod_db_pv_usage_med: Refreshing state... [id=9921934]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_db_pods_high: Refreshing state... [id=9921906]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_db_pod_restarts_gte_1: Refreshing state... [id=9921905]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_db_pods_low: Refreshing state... [id=9921900]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_cpu_usage_med: Refreshing state... [id=9921903]
module.eb75ad-team.sysdig_monitor_alert_promql.dev_db_pv_usage_seventyfive: Refreshing state... [id=14625866]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_log_pv_med: Refreshing state... [id=9921922]
module.eb75ad-team.sysdig_monitor_dashboard.pods_cpu: Refreshing state... [id=363086]
module.eb75ad-team.sysdig_monitor_alert_promql.test_db_pv_usage_ninety: Refreshing state... [id=14625872]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_cpu_spike_high: Refreshing state... [id=9921904]
module.eb75ad-team.sysdig_monitor_alert_promql.test_db_pv_usage_seventyfive: Refreshing state... [id=14625869]
module.silver-6d70e7-team.sysdig_monitor_alert_metric.keycloak_cpu_spike_high: Refreshing state... [id=10777955]
module.silver-6d70e7-team.sysdig_monitor_alert_promql.patroni_test_pvc_over_ninety: Refreshing state... [id=14625867]
module.silver-6d70e7-team.sysdig_monitor_alert_metric.patroni_pods_down_med: Refreshing state... [id=10777961]
module.silver-6d70e7-team.sysdig_monitor_alert_promql.patroni_pod_not_ready_med: Refreshing state... [id=10777975]
module.silver-6d70e7-team.sysdig_monitor_alert_metric.pgsql_pod_restart_med: Refreshing state... [id=10777964]
module.silver-6d70e7-team.sysdig_monitor_alert_promql.keycloak_pod_not_ready_med: Refreshing state... [id=10777977]
module.silver-6d70e7-team.sysdig_monitor_alert_promql.patroni_test_pvc_over_seventyfive: Refreshing state... [id=14625873]
module.silver-6d70e7-team.sysdig_monitor_alert_metric.sso_pod_restart: Refreshing state... [id=10777958]
module.silver-6d70e7-team.sysdig_monitor_alert_promql.keycloak_pod_not_ready_high: Refreshing state... [id=10777978]
module.silver-6d70e7-team.sysdig_monitor_alert_promql.patroni_pvc_over_sixty: Refreshing state... [id=10783943]
module.silver-6d70e7-team.sysdig_monitor_alert_metric.patroni_pods_down_low: Refreshing state... [id=10777967]
module.silver-6d70e7-team.sysdig_monitor_alert_promql.patroni_dev_pvc_over_ninety: Refreshing state... [id=14625868]
module.silver-6d70e7-team.sysdig_monitor_alert_metric.db_filesystem_limit_med: Refreshing state... [id=10777963]
module.silver-6d70e7-team.sysdig_monitor_alert_promql.patroni_pod_not_ready_high: Refreshing state... [id=10777976]
module.silver-6d70e7-team.sysdig_monitor_dashboard.silver_pvc_dashboard_b: Refreshing state... [id=296972]
module.silver-6d70e7-team.sysdig_monitor_alert_promql.patroni_backup_pvc_over_eighty: Refreshing state... [id=10783946]
module.silver-6d70e7-team.sysdig_monitor_alert_metric.patroni_backup_storage_low: Refreshing state... [id=10777968]
module.silver-6d70e7-team.sysdig_monitor_alert_promql.keycloak_pod_not_ready_low: Refreshing state... [id=10777974]
module.silver-6d70e7-team.sysdig_monitor_dashboard.sso_production_pods: Refreshing state... [id=296983]
module.silver-6d70e7-team.sysdig_monitor_alert_metric.keycloak_cpu_elevated_high: Refreshing state... [id=10777956]
module.silver-6d70e7-team.sysdig_monitor_alert_metric.patroni_pods_down_high: Refreshing state... [id=10777966]
module.silver-6d70e7-team.sysdig_monitor_alert_promql.patroni_dev_pvc_over_seventyfive: Refreshing state... [id=14625870]
module.silver-6d70e7-team.sysdig_monitor_alert_metric.sso_cpu_spike_med: Refreshing state... [id=10777959]
module.silver-6d70e7-team.sysdig_monitor_alert_metric.sso_pods_down_high: Refreshing state... [id=10777965]
module.silver-6d70e7-team.sysdig_monitor_alert_promql.log_pvc_over_eighty: Refreshing state... [id=10783944]
module.silver-6d70e7-team.sysdig_monitor_alert_metric.sso_pods_down_low: Refreshing state... [id=10777957]
module.silver-6d70e7-team.sysdig_monitor_alert_promql.patroni_backup_pvc_over_sixty: Refreshing state... [id=10783945]
module.silver-6d70e7-team.sysdig_monitor_alert_metric.sso_pods_down_med: Refreshing state... [id=10777960]
module.silver-6d70e7-team.sysdig_monitor_alert_promql.log_pvc_over_sixty: Refreshing state... [id=10783942]
module.silver-6d70e7-team.sysdig_monitor_alert_promql.db_pvc_sixty_percent: Refreshing state... [id=10777962]
module.c6af30-team.sysdig_monitor_alert_metric.prod_db_pod_restarts_gte_1: Refreshing state... [id=10777729]
module.c6af30-team.sysdig_monitor_alert_metric.prod_keycloak_cpu_spike_high: Refreshing state... [id=10777728]
module.c6af30-team.sysdig_monitor_dashboard.pv_overall: Refreshing state... [id=296847]
module.c6af30-team.sysdig_monitor_alert_metric.prod_db_pods_low: Refreshing state... [id=10777732]
module.c6af30-team.sysdig_monitor_alert_metric.prod_db_pods_high: Refreshing state... [id=10777727]
module.c6af30-team.sysdig_monitor_alert_metric.prod_keycloak_cpu_usage_med: Refreshing state... [id=10777726]
module.c6af30-team.sysdig_monitor_dashboard.pv_usage: Refreshing state... [id=296849]
module.c6af30-team.sysdig_monitor_alert_metric.prod_keycloak_pods_high: Refreshing state... [id=10777724]
module.c6af30-team.sysdig_monitor_alert_metric.prod_keycloak_cpu_usage_high: Refreshing state... [id=10777725]
module.c6af30-team.sysdig_monitor_alert_promql.prod_sso_db_pv_gt_80: Refreshing state... [id=10777733]
module.c6af30-team.sysdig_monitor_alert_metric.prod_keycloak_pods_low: Refreshing state... [id=10777730]
module.c6af30-team.sysdig_monitor_alert_metric.prod_keycloak_pods_med: Refreshing state... [id=10777734]
module.c6af30-team.sysdig_monitor_dashboard.pods_cpu: Refreshing state... [id=296848]
module.c6af30-team.sysdig_monitor_alert_promql.prod_sso_db_pv_gt_60: Refreshing state... [id=10777731]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.eb75ad-team.sysdig_monitor_alert_promql.dev_db_pv_usage_ninety has changed
  ~ resource "sysdig_monitor_alert_promql" "dev_db_pv_usage_ninety" {
        id                    = "14625871"
        name                  = "[GOLD CUST DEV] SSO DB PV over 90%"
      + team                  = 40193
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eb75ad-team.sysdig_monitor_alert_promql.dev_db_pv_usage_seventyfive has changed
  ~ resource "sysdig_monitor_alert_promql" "dev_db_pv_usage_seventyfive" {
        id                    = "14625866"
        name                  = "[GOLD CUST DEV] SSO DB PV over 75%"
      + team                  = 40193
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eb75ad-team.sysdig_monitor_alert_promql.test_db_pv_usage_ninety has changed
  ~ resource "sysdig_monitor_alert_promql" "test_db_pv_usage_ninety" {
        id                    = "14625872"
        name                  = "[GOLD CUST TEST] SSO DB PV over 90%"
      + team                  = 40193
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eb75ad-team.sysdig_monitor_alert_promql.test_db_pv_usage_seventyfive has changed
  ~ resource "sysdig_monitor_alert_promql" "test_db_pv_usage_seventyfive" {
        id                    = "14625869"
        name                  = "[GOLD CUST TEST] SSO DB PV over 75%"
      + team                  = 40193
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.silver-6d70e7-team.sysdig_monitor_alert_metric.pgsql_pod_restart_med has changed
  ~ resource "sysdig_monitor_alert_metric" "pgsql_pod_restart_med" {
        id                    = "10777964"
      ~ metric                = "sum(avg(kubernetes.pod.restart.count)) > 2" -> "sum(avg(kube_pod_sysdig_restart_count)) > 3.0"
        name                  = "App - Prod - SSO-PGSQL - Pod Restart Terraform Silver"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.silver-6d70e7-team.sysdig_monitor_alert_promql.patroni_dev_pvc_over_ninety has changed
  ~ resource "sysdig_monitor_alert_promql" "patroni_dev_pvc_over_ninety" {
        id                    = "14625868"
        name                  = "Patroni - Dev PVCs > 90% Terraform Silver"
      + team                  = 34492
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.silver-6d70e7-team.sysdig_monitor_alert_promql.patroni_dev_pvc_over_seventyfive has changed
  ~ resource "sysdig_monitor_alert_promql" "patroni_dev_pvc_over_seventyfive" {
        id                    = "14625870"
        name                  = "Patroni - Dev PVCs > 75% Terraform Silver"
      + team                  = 34492
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.silver-6d70e7-team.sysdig_monitor_alert_promql.patroni_test_pvc_over_ninety has changed
  ~ resource "sysdig_monitor_alert_promql" "patroni_test_pvc_over_ninety" {
        id                    = "14625867"
        name                  = "Patroni - Test PVCs > 90% Terraform Silver"
      + team                  = 34492
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.silver-6d70e7-team.sysdig_monitor_alert_promql.patroni_test_pvc_over_seventyfive has changed
  ~ resource "sysdig_monitor_alert_promql" "patroni_test_pvc_over_seventyfive" {
        id                    = "14625873"
        name                  = "Patroni - Test PVCs > 75% Terraform Silver"
      + team                  = 34492
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.eb75ad-team.sysdig_monitor_alert_metric.dev_dr_pod will be created
  + resource "sysdig_monitor_alert_metric" "dev_dr_pod" {
      + description           = "only alert rocket chat and email"
      + enabled               = true
      + id                    = (known after apply)
      + metric                = "sum(min(kube_pod_sysdig_status_ready)) < 1"
      + multiple_alerts_by    = []
      + name                  = "[GOLDDR DEV] Switchover Agent Pod Count"
      + notification_channels = [
          + 45990,
          + 57336,
        ]
      + scope                 = "kubernetes.cluster.name in (\"golddr\") and kubernetes.namespace.name in (\"eb75ad-dev\") and kubernetes.pod.name contains \"switchover-agent\""
      + severity              = 4
      + team                  = (known after apply)
      + trigger_after_minutes = 15
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.eb75ad-team.sysdig_monitor_alert_metric.prod_dr_pod will be created
  + resource "sysdig_monitor_alert_metric" "prod_dr_pod" {
      + description           = "only alert rocket chat and email"
      + enabled               = true
      + id                    = (known after apply)
      + metric                = "sum(min(kube_pod_sysdig_status_ready)) < 1"
      + multiple_alerts_by    = []
      + name                  = "[GOLDDR PROD] Switchover Agent Pod Count"
      + notification_channels = [
          + 45990,
          + 57336,
        ]
      + scope                 = "kubernetes.cluster.name in (\"golddr\") and kubernetes.namespace.name in (\"eb75ad-prod\") and kubernetes.pod.name contains \"switchover-agent\""
      + severity              = 4
      + team                  = (known after apply)
      + trigger_after_minutes = 15
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.eb75ad-team.sysdig_monitor_alert_metric.test_dr_pod will be created
  + resource "sysdig_monitor_alert_metric" "test_dr_pod" {
      + description           = "only alert rocket chat and email"
      + enabled               = true
      + id                    = (known after apply)
      + metric                = "sum(min(kube_pod_sysdig_status_ready)) < 1"
      + multiple_alerts_by    = []
      + name                  = "[GOLDDR TEST] Switchover Agent Pod Count"
      + notification_channels = [
          + 45990,
          + 57336,
        ]
      + scope                 = "kubernetes.cluster.name in (\"golddr\") and kubernetes.namespace.name in (\"eb75ad-test\") and kubernetes.pod.name contains \"switchover-agent\""
      + severity              = 4
      + team                  = (known after apply)
      + trigger_after_minutes = 15
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.silver-6d70e7-team.sysdig_monitor_alert_metric.pgsql_pod_restart_med will be updated in-place
  ~ resource "sysdig_monitor_alert_metric" "pgsql_pod_restart_med" {
        id                    = "10777964"
      ~ metric                = "sum(avg(kube_pod_sysdig_restart_count)) > 3.0" -> "sum(avg(kubernetes.pod.restart.count)) > 3"
        name                  = "App - Prod - SSO-PGSQL - Pod Restart Terraform Silver"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @thegentlemanphysicist, Action: `pull_request`*